# vim: set ft=ruby

cask_args appdir: '/Applications'
tap 'homebrew/cask'
brew 'mas'

brew 'git'
brew 'zsh'
brew 'make'

tap 'neovim/neovim'
brew 'neovim', args: ['HEAD']

brew 'openssl'
brew 'coreutils'
brew 'gnu-tar'
brew 'fzf'
brew 'reattach-to-user-namespace'
brew 'tmux'
brew 'ripgrep'
brew 'direnv'
brew 'youtube-dl'
brew 'ffmpeg' # dependency of youtube-dl
brew 'wget'
brew 'curl'
brew 'gnu-sed'
brew 'z'
brew 'cloc'
brew 'jq'
brew 'tree'
brew 'gh'
brew 'dep'
brew 'sqlite3'
brew 'pandoc'
brew 'redis'
brew 'nginx'
brew 'gnupg'
brew 'golang-migrate'
brew 'awscli'
brew 'hugo'
brew 'proctools'
brew 'watchman'
brew 'tldr'
brew 'vegeta'
brew 'graphviz'
brew 'gcc'
brew 'exa'
brew 'dust'
brew 'bat'
brew 'moreutils'
brew 'kubernetes-cli'
brew 'kubectx'
brew 'watch'
brew 'bash'
brew 'shellcheck'
brew 'shfmt'
brew 'pgrep'
brew 'pkill'

tap 'universal-ctags/homebrew-universal-ctags'
brew 'universal-ctags', args: ['HEAD']

tap 'TankerHQ/homebrew-repo'
brew 'ruplacer'

brew 'asdf'
# asdf dependencies
brew 'automake'
brew 'autoconf'
brew 'libyaml'
brew 'readline'
brew 'libxslt'
brew 'libtool'
brew 'unixodbc'
brew 'unzip'
# Go/Node/Yarn/Ruby installed with asdf
# Rust installed manually via: https://rustup.rs/
# comby dependencies
brew 'pkg-config'
brew 'pcre'
brew 'comby'

cask 'firefox'
cask 'alfred'
cask '1password'
cask 'dropbox'
cask 'keepingyouawake'
cask 'rectangle'
cask 'slack'
cask 'istat-menus'
cask 'zoom'
cask 'docker'
cask 'whatsapp'
cask 'signal'
cask 'spotify'
cask 'vlc'
cask 'adobe-acrobat-reader'
cask 'kitty'
cask 'google-chrome'
cask 'vagrant'
# Postgres.app
cask 'libreoffice'
cask 'google-cloud-sdk'
cask 'visual-studio-code'
cask 'postico'
cask 'muzzle'
cask 'bartender'
cask 'cleanshot'
cask 'screenflow'
cask 'obs'
cask 'imageoptim'
cask 'barrier'

cask 'monodraw'
# Doesn't exist anymore?
# cask 'KindleGen'
cask 'basictex'

tap 'homebrew/cask-drivers'
cask 'sonos'
cask 'focusrite-control' # Drivers for Focusrite Scarlett
cask 'elgato-control-center'
# cask 'uhk-agent' # Driver for Ultimate Hacking Keyboard

tap 'homebrew/cask-fonts'
cask 'font-hack'
cask 'font-jetbrains-mono'
cask 'font-inconsolata'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-ibm-plex'

mas 'Fantastical 2', id: 975937182
mas 'Xcode', id: 497799835
mas 'Todoist', id: 585829637
mas 'Pixelmator', id: 407963104
mas 'Kindle', id: 405399194
mas 'MoneyMoney', id: 872698314
mas 'Microsoft Word', id: 462054704
mas 'Microsoft Excel', id: 462058435
mas 'Tailscale', id: 1475387142
