# vim: set ft=ruby

cask_args appdir: '/Applications'
tap 'homebrew/cask'
brew 'mas'

brew 'git'
brew 'zsh'
brew 'make'

tap 'neovim/neovim'
brew 'neovim'

tap 'd12frosted/emacs-plus'
brew 'emacs-plus', args: ['HEAD', 'with-modern-icon', 'without-spacemacs-icon']

brew 'openssl'
brew 'coreutils'
brew 'gnu-tar'
brew 'fzf'
brew 'reattach-to-user-namespace'
brew 'tmux'
brew 'ripgrep'
brew 'direnv'
brew 'youtube-dl'
brew 'wget'
brew 'curl'
brew 'gnu-sed', args: ['with-default-names']
brew 'z'
brew 'cloc'
brew 'terraform'
brew 'jq'
brew 'tree'
brew 'hub'
brew 'dep'
brew 'node'
brew 'yarn'
brew 'sqlite3'
brew 'pandoc'
brew 'redis'
brew 'nginx'
brew 'gnupg'
brew 'golang-migrate'
brew 'awscli'
brew 'pulumi'
brew 'hugo'
brew 'proctools'
brew 'watchman'
brew 'tldr'
brew 'vegeta'
brew 'graphviz'
brew 'gcc'
brew 'chezscheme'
brew 'exa'
brew 'dust'
brew 'bat'
brew 'moreutils'
brew 'kubernetes-cli'
brew 'kubectx'
brew 'watch'

tap 'universal-ctags/homebrew-universal-ctags'
brew 'universal-ctags', args: ['HEAD']

tap 'TankerHQ/homebrew-repo'
brew 'ruplacer'

brew 'asdf'
# asdf dependencies
brew 'automake'
brew 'autoconf'
brew 'libyaml'
brew 'readline'
brew 'libxslt'
brew 'libtool'
brew 'unixodbc'
brew 'unzip'
# Go installed with asdf
# Ruby installed with asdf
# Node installed with asdf
# Rust installed manually via: https://rustup.rs/
# OCaml
brew 'opam'
# comby dependencies
brew 'pkg-config'
brew 'pcre'

cask 'firefox'
cask 'iterm2'
cask 'alfred'
cask '1password'
cask 'dropbox'
cask 'keepingyouawake'
cask 'sizeup'
cask 'slack'
cask 'arq'
cask 'tunnelblick'
cask 'istat-menus'
cask 'zoomus'
cask 'racket'
cask 'docker'
cask 'whatsapp'
cask 'spotify'
cask 'karabiner-elements'
cask 'vlc'
cask 'adobe-acrobat-reader'
cask 'kitty'
cask 'google-chrome'
cask 'virtualbox'
cask 'vagrant'
cask 'skype'
cask 'typora'
cask 'licecap'
cask 'postgres'
cask 'libreoffice'
cask 'google-cloud-sdk'
cask 'visual-studio-code'
cask 'pgadmin4'
cask 'muzzle'

cask 'monodraw'
cask 'KindleGen'
cask 'basictex'

cask 'bartender'
cask 'cleanshot'
cask 'screenflow'
cask 'obs'

tap 'homebrew/cask-drivers'
cask 'sonos'
cask 'focusrite-control' # Drivers for Focusrite Scarlett

mas 'Fantastical 2', id: 975937182
mas 'Xcode', id: 497799835
mas 'Todoist', id: 585829637
mas 'Pixelmator', id: 407963104
mas 'Kindle', id: 405399194
mas 'MoneyMoney', id: 872698314
mas 'Microsoft Word', id: 462054704
mas 'Microsoft Excel', id: 462058435

# 'Keyboard Cleaner' directly downloaded from here:
# http://jan.prima.de/plok/archives/48-Keyboard-Cleaner.html
