# vim: set ft=ruby

brew 'git'
brew 'zsh'
brew 'bash'
brew 'fish'
brew 'make'
brew 'cmake'
brew 'openssl'
brew 'coreutils'
brew 'gnu-tar'
brew 'fzf'
brew 'reattach-to-user-namespace'
brew 'tmux'
brew 'ripgrep'
brew 'direnv'
brew 'ffmpeg'
brew 'wget'
brew 'curl'
brew 'gnu-sed'
brew 'z'
brew 'cloc'
brew 'jq'
brew 'tree'
brew 'gh'
brew 'sqlite3'
brew 'pandoc'
brew 'gnupg'
brew 'hugo'
brew 'graphviz'
brew 'gcc'
brew 'moreutils'
brew 'watch'
brew 'shellcheck'
brew 'shfmt'
brew 'pgrep'
brew 'pkill'
brew 'neovim'
brew 'atuin'
brew 'btop'
brew 'neofetch'
brew 'zoxide'

# See: https://apple.stackexchange.com/questions/431812/how-can-i-stop-a-bluetooth-keyboard-from-waking-my-macbook-pro/437396#437396
brew 'sleepwatcher'
brew 'blueutil'

# brew 'asdf'
# asdf dependencies
# brew 'automake'
# brew 'autoconf'
# brew 'libyaml'
# brew 'readline'
# brew 'libxslt'
# brew 'libtool'
# brew 'unixodbc'
# brew 'unzip'

# Let's try mise
brew 'mise'
brew 'libyaml' # libyaml is needed for Ruby/ruby-build

cask 'postgres-unofficial'
brew 'livekit'
brew 'postgrest'
brew 'foreman'

brew 'claude'
brew 'ghostty'
brew 'raycast'
brew 'arq'
brew 'cursor'
brew 'windsurf'

cask 'soundsource'
cask 'keepingyouawake'
cask 'slack'
cask 'istat-menus'
cask 'zoom'
cask 'whatsapp'
cask 'signal'
cask 'spotify'
cask 'vlc'
cask 'visual-studio-code'
cask 'postico'
cask 'cleanshot'
cask 'screenflow'
cask 'obs'
cask 'imageoptim'
cask 'barrier'
cask 'discord'
cask 'orbstack'
cask 'vmware-fusion'
cask 'monodraw'
# Doesn't exist anymore?
# cask 'KindleGen'
cask 'basictex'
cask 'imageoptim'
cask 'handbrake'
cask 'figma'
# terminal emulators
cask 'wezterm'
cask 'alacritty'
cask 'kitty'
cask 'contour'
cask 'iterm2'

# try this
cask 'synology-drive'

cask 'sonos'
cask 'focusrite-control' # Drivers for Focusrite Scarlett
cask 'elgato-control-center'

tap 'homebrew/cask-fonts'
cask 'font-hack'
cask 'font-jetbrains-mono'
cask 'font-inconsolata'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-ibm-plex'

mas 'Fantastical 2', id: 975937182
mas 'Xcode', id: 497799835
mas 'Todoist', id: 585829637
mas 'Pixelmator Pro', id: 1289583905
mas 'Kindle', id: 405399194
mas 'MoneyMoney', id: 872698314
mas 'Microsoft Word', id: 462054704
mas 'Microsoft Excel', id: 462058435
mas 'Tailscale', id: 1475387142
